{
    "home": {
        "heroTitle": "โอบรับความนุ่มนวลอย่างเป็นธรรมชาติ",
        "heroSubtitle": "ค้นพบความสบายที่ไม่มีใครเทียบของ Saru คอลเลกชันของเราที่รังสรรค์จากผ้าฝ้ายมัสลินที่ดีที่สุดเพื่อสัมผัสที่อ่อนโยนและระบายอากาศได้ดี",
        "shopCollection": "เลือกซื้อคอลเลกชัน",
        "featuredProductsTitle": "สินค้าแนะนำ",
        "featuredProductsSubtitle": "คัดสรรมาเพื่อคุณโดยเฉพาะ ชิ้นงานเหล่านี้แสดงถึงความสบายและสไตล์ที่ดีที่สุดของ Saru Story",
        "viewAllProducts": "ดูสินค้าทั้งหมด",
        "magicOfMuslinTitle": "ความมหัศจรรย์ของผ้าฝ้ายมัสลิน",
        "magicOfMuslinSubtitle": "เป็นมากกว่าเนื้อผ้า แต่คือความรู้สึก ค้นพบคุณสมบัติที่ทำให้ผ้าฝ้ายมัสลินของเราพิเศษ",
        "featureSoftnessTitle": "ความนุ่มนวลที่ไม่มีใครเทียบ",
        "featureSoftnessDescription": "ผ้าฝ้ายมัสลินสองชั้นของเราจะนุ่มขึ้นทุกครั้งที่ซัก ให้ความรู้สึกอ่อนโยนและหรูหราต่อผิวของคุณ",
        "featureBreathableTitle": "ระบายอากาศได้ดีเยี่ยม",
        "featureBreathableDescription": "การทอแบบเปิดของผ้าฝ้ายมัสลินช่วยให้ระบายอากาศได้ดีเยี่ยม ทำให้คุณรู้สึกเย็นสบายในสภาพอากาศที่ร้อนขึ้น",
        "featureRegulatingTitle": "ควบคุมอุณหภูมิตามธรรมชาติ",
        "featureRegulatingDescription": "ผ้าฝ้ายมัสลินเป็นฉนวนน้ำหนักเบา ช่วยให้คุณอบอุ่นในที่เย็นและเย็นสบายในที่ร้อน",
        "featureEcoFriendlyTitle": "เป็นมิตรกับสิ่งแวดล้อมและยั่งยืน",
        "featureEcoFriendlyDescription": "ผลิตจากเส้นใยธรรมชาติและย้อมด้วยสีจากพืช เนื้อผ้าของเราจึงเป็นมิตรต่อโลก",
        "fabricOfOurLivesTitle": "เนื้อผ้าแห่งชีวิตของเรา",
        "fabricOfOurLivesSubtitle": "ทุกเส้นด้ายบอกเล่าเรื่องราวของประเพณี ธรรมชาติ และความหลงใหล เรียนรู้เกี่ยวกับการเดินทางของเราและแนวทางปฏิบัติที่ยั่งยืนเบื้องหลังเสื้อผ้าทุกชิ้น",
        "ourStory": "เรื่องราวของเรา"
    },
    "nav": {
        "products": "สินค้า",
        "ourStory": "เรื่องราวของเรา",
        "whySaru": "ทำไมต้อง Saru?"
    },
    "header": {
        "userAccount": "บัญชีผู้ใช้"
    },
    "footer": {
        "tagline": "รังสรรค์ความสบายด้วยผ้าฝ้ายมัสลินจากธรรมชาติ",
        "shop": "เลือกซื้อ",
        "allProducts": "สินค้าทั้งหมด",
        "shirts": "เสื้อเชิ้ต",
        "dresses": "เดรส",
        "about": "เกี่ยวกับ",
        "ourStory": "เรื่องราวของเรา",
        "whySaru": "ทำไมต้อง Saru?",
        "followUs": "ติดตามเรา",
        "rightsReserved": "สงวนลิขสิทธิ์"
    },
    "cart": {
        "openCart": "เปิดตะกร้าสินค้า",
        "title": "ตะกร้าสินค้า",
        "size": "ขนาด",
        "color": "สี",
        "subtotal": "ยอดรวม",
        "shippingTaxes": "ค่าจัดส่งและภาษีจะคำนวณในขั้นตอนต่อไป",
        "checkout": "ไปยังหน้าชำระเงิน",
        "empty": "ตะกร้าสินค้าของคุณว่างเปล่า",
        "continueShopping": "เลือกซื้อสินค้าต่อ"
    },
    "productCard": {
        "viewDetails": "ดูรายละเอียด"
    },
    "product": {
        "color": "สี",
        "size": "ขนาด",
        "addToCart": "เพิ่มลงในตะกร้า"
    },
    "products": {
        "title": "คอลเลคชันของเรา",
        "subtitle": "ค้นพบเสื้อผ้าที่ออกแบบมาเพื่อความสบายและสไตล์ที่เหนือกาลเวลา",
        "filterCategory": "กรองตามหมวดหมู่",
        "allCategories": "ทุกหมวดหมู่",
        "filterColor": "กรองตามสี",
        "allColors": "ทุกสี",
        "filterSize": "กรองตามขนาด",
        "allSizes": "ทุกขนาด",
        "noProductsFound": "ไม่พบสินค้าที่ตรงกับเกณฑ์ของคุณ"
    },
    "story": {
        "title": "เรื่องราวของเรา",
        "subtitle": "จากด้ายเส้นเล็กสู่ฝันที่ยั่งยืน",
        "p1": "Saru Story ไม่ได้เริ่มต้นในสตูดิโอออกแบบ แต่เริ่มขึ้นในช่วงเวลาที่เงียบสงบของการชื่นชมสิ่งเรียบง่าย มันเริ่มต้นจากความรักในเนื้อผ้าที่ให้ความรู้สึกเหมือนเป็นผิวที่สอง สำหรับเสื้อผ้าที่ไม่รัดแน่นแต่พริ้วไหว และสำหรับวิถีชีวิตที่ให้เกียรติทั้งผู้คนและโลก",
        "h2_1": "การค้นพบผ้าฝ้ายมัสลิน",
        "p2": "การเดินทางของเรานำเราไปสู่ผ้าฝ้ายมัสลิน หรือ 'สาลู' ที่รู้จักกันในหลายวัฒนธรรม ผ้าโบราณนี้ซึ่งเป็นที่รู้จักในด้านความนุ่มนวลและการระบายอากาศที่น่าทึ่ง ทำให้เราหลงใหล เราทึ่งในประวัติศาสตร์ของมัน ซึ่งตามเนื้อผ้าแล้วใช้สำหรับห่อตัวทารกแรกเกิด ซึ่งเป็นข้อพิสูจน์ถึงธรรมชาติที่อ่อนโยนและปกป้อง เราสงสัยว่า: ทำไมความสบายนี้จึงจำกัดอยู่แค่ทารก?",
        "p3": "คำถามนี้จุดประกายภารกิจของเรา: เพื่อนำความสบายอันอ่อนโยนของผ้าฝ้ายมัสลินมาสู่การสวมใส่ในชีวิตประจำวัน เราจินตนาการถึงเสื้อผ้าที่รวบรวมความรู้สึกสงบ ความสบาย และความสง่างามที่เรียบง่าย",
        "h2_2": "ความมุ่งมั่นในงานฝีมือและชุมชน",
        "p4": "เราเชื่อว่า 'อย่างไร' มีความสำคัญพอๆ กับ 'อะไร' นั่นคือเหตุผลที่เราเป็นพันธมิตรกับชุมชนช่างฝีมือขนาดเล็กที่ได้พัฒนาศิลปะการทอผ้ามาหลายชั่วอายุคน ผ้าของเราย้อมโดยใช้ส่วนผสมจากพืชธรรมชาติ ซึ่งเป็นกระบวนการที่ช้าและตั้งใจ ส่งผลให้ได้เฉดสีเอิร์ธโทนที่เป็นเอกลักษณ์ซึ่งอ่อนโยนต่อผิวของคุณและสิ่งแวดล้อม",
        "p5": "เสื้อผ้าทุกชิ้นของ Saru Story คือการเฉลิมฉลองความร่วมมือนี้ ซึ่งเป็นการผสมผสานระหว่างงานฝีมือแบบดั้งเดิมและการออกแบบร่วมสมัย มันเป็นมากกว่าแค่เสื้อผ้า มันคือส่วนหนึ่งของเรื่องราว ความมุ่งมั่นในการบริโภคอย่างมีสติ และคำเชิญชวนให้ใช้ชีวิตอย่างนุ่มนวลยิ่งขึ้น"
    },
    "whySaru": {
        "title": "ทำไมต้อง Saru?",
        "subtitle": "ความมหัศจรรย์อันเรียบง่ายของผ้าฝ้ายมัสลิน",
        "p1": "Saru เป็นมากกว่าแค่ชื่อ แต่เป็นคำของเราที่ใช้เรียกผ้าฝ้ายมัสลิน ซึ่งเป็นผ้าที่ได้รับการยกย่องมานานหลายศตวรรษในด้านคุณสมบัติที่เป็นเอกลักษณ์ เราเลือกผ้าฝ้ายมัสลินไม่ใช่แค่เพราะความสวยงาม แต่เพื่อประโยชน์อันน่าทึ่งที่มันนำมาสู่ชีวิตประจำวันของคุณ มันเป็นผ้าที่ดูแลคุณ เช่นเดียวกับที่เราใส่ใจในวิธีการผลิต"
    },
    "login": {
        "title": "ยินดีต้อนรับกลับ",
        "subtitle": "ป้อนอีเมลของคุณเพื่อเข้าสู่ระบบบัญชีของคุณ",
        "email": "อีเมล",
        "password": "รหัสผ่าน",
        "signIn": "เข้าสู่ระบบ",
        "noAccount": "ยังไม่มีบัญชี?",
        "signUp": "สมัครสมาชิก"
    },
    "register": {
        "title": "สร้างบัญชี",
        "subtitle": "ป้อนข้อมูลของคุณเพื่อสร้างบัญชี",
        "name": "ชื่อ",
        "namePlaceholder": "ชื่อของคุณ",
        "email": "อีเมล",
        "password": "รหัสผ่าน",
        "createAccount": "สร้างบัญชี",
        "hasAccount": "มีบัญชีอยู่แล้ว?",
        "signIn": "เข้าสู่ระบบ"
    },
    "checkout": {
        "emptyCartTitle": "ตะกร้าสินค้าของคุณว่างเปล่า",
        "emptyCartSubtitle": "ดูเหมือนว่าคุณยังไม่ได้เพิ่มสินค้าใดๆ ลงในตะกร้า",
        "startShopping": "เริ่มช้อปปิ้ง",
        "title": "ชำระเงิน",
        "shippingInfo": "ข้อมูลการจัดส่ง",
        "fullName": "ชื่อ-นามสกุล",
        "address": "ที่อยู่",
        "city": "เมือง",
        "postalCode": "รหัสไปรษณีย์",
        "country": "ประเทศ",
        "paymentMethod": "วิธีการชำระเงิน",
        "paymentNotImplemented": "ยังไม่เปิดให้บริการชำระเงิน",
        "placeOrder": "สั่งซื้อสินค้า",
        "orderSummary": "สรุปรายการสั่งซื้อ",
        "quantity": "จำนวน",
        "subtotal": "ยอดรวม",
        "shipping": "ค่าจัดส่ง",
        "free": "ฟรี",
        "taxes": "ภาษี",
        "calculatedAtNextStep": "จะคำนวณในขั้นตอนถัดไป",
        "total": "ทั้งหมด"
    }
}