
{
    "home": {
        "heroTitle": "โอบรับความนุ่มนวลอย่างเป็นธรรมชาติ",
        "heroSubtitle": "ค้นพบความสบายที่ไม่มีใครเทียบของ Saru คอลเลกชันของเราที่รังสรรค์จากผ้าฝ้ายมัสลินที่ดีที่สุดเพื่อสัมผัสที่อ่อนโยนและระบายอากาศได้ดี",
        "shopCollection": "เลือกซื้อคอลเลกชัน",
        "featuredProductsTitle": "สินค้าแนะนำ",
        "featuredProductsSubtitle": "คัดสรรมาเพื่อคุณโดยเฉพาะ ชิ้นงานเหล่านี้แสดงถึงความสบายและสไตล์ที่ดีที่สุดของ Saru Story",
        "viewAllProducts": "ดูสินค้าทั้งหมด",
        "magicOfMuslinTitle": "ความมหัศจรรย์ของผ้าฝ้ายมัสลิน",
        "magicOfMuslinSubtitle": "เป็นมากกว่าเนื้อผ้า แต่คือความรู้สึก ค้นพบคุณสมบัติที่ทำให้ผ้าฝ้ายมัสลินของเราพิเศษ",
        "featureSoftnessTitle": "ความนุ่มนวลที่ไม่มีใครเทียบ",
        "featureSoftnessDescription": "ผ้าฝ้ายมัสลินสองชั้นของเราจะนุ่มขึ้นทุกครั้งที่ซัก ให้ความรู้สึกอ่อนโยนและหรูหราต่อผิวของคุณ",
        "featureBreathableTitle": "ระบายอากาศได้ดีเยี่ยม",
        "featureBreathableDescription": "การทอแบบเปิดของผ้าฝ้ายมัสลินช่วยให้ระบายอากาศได้ดีเยี่ยม ทำให้คุณรู้สึกเย็นสบายในสภาพอากาศที่ร้อนขึ้น",
        "featureRegulatingTitle": "ควบคุมอุณหภูมิตามธรรมชาติ",
        "featureRegulatingDescription": "ผ้าฝ้ายมัสลินเป็นฉนวนน้ำหนักเบา ช่วยให้คุณอบอุ่นในที่เย็นและเย็นสบายในที่ร้อน",
        "featureEcoFriendlyTitle": "เป็นมิตรกับสิ่งแวดล้อมและยั่งยืน",
        "featureEcoFriendlyDescription": "ผลิตจากเส้นใยธรรมชาติและย้อมด้วยสีจากพืช เนื้อผ้าของเราจึงเป็นมิตรต่อโลก",
        "fabricOfOurLivesTitle": "เนื้อผ้าแห่งชีวิตของเรา",
        "fabricOfOurLivesSubtitle": "ทุกเส้นด้ายบอกเล่าเรื่องราวของประเพณี ธรรมชาติ และความหลงใหล เรียนรู้เกี่ยวกับการเดินทางของเราและแนวทางปฏิบัติที่ยั่งยืนเบื้องหลังเสื้อผ้าทุกชิ้น",
        "ourStory": "เรื่องราวของเรา"
    },
    "nav": {
        "products": "สินค้า",
        "ourStory": "เรื่องราวของเรา",
        "whySaru": "ทำไมต้อง Saru?"
    },
    "header": {
        "userAccount": "บัญชีผู้ใช้",
        "profile": "โปรไฟล์",
        "signOut": "ออกจากระบบ"
    },
    "footer": {
        "tagline": "รังสรรค์ความสบายด้วยผ้าฝ้ายมัสลินจากธรรมชาติ",
        "shop": "เลือกซื้อ",
        "allProducts": "สินค้าทั้งหมด",
        "shirts": "เสื้อเชิ้ต",
        "dresses": "เดรส",
        "about": "เกี่ยวกับ",
        "ourStory": "เรื่องราวของเรา",
        "whySaru": "ทำไมต้อง Saru?",
        "followUs": "ติดตามเรา",
        "rightsReserved": "สงวนลิขสิทธิ์"
    },
    "cart": {
        "openCart": "เปิดตะกร้าสินค้า",
        "title": "ตะกร้าสินค้า",
        "size": "ขนาด",
        "color": "สี",
        "subtotal": "ยอดรวม",
        "shippingTaxes": "ค่าจัดส่งและภาษีจะคำนวณในขั้นตอนต่อไป",
        "checkout": "ไปยังหน้าชำระเงิน",
        "empty": "ตะกร้าสินค้าของคุณว่างเปล่า",
        "continueShopping": "เลือกซื้อสินค้าต่อ"
    },
    "productCard": {
        "viewDetails": "ดูรายละเอียด",
        "addToCart": "เพิ่มไปยังตะกร้า"
    },
    "product": {
        "color": "สี",
        "size": "ขนาด",
        "addToCart": "เพิ่มลงในตะกร้า"
    },
    "products": {
        "title": "คอลเลคชันของเรา",
        "subtitle": "ค้นพบเสื้อผ้าที่ออกแบบมาเพื่อความสบายและสไตล์ที่เหนือกาลเวลา",
        "filterCategory": "กรองตามหมวดหมู่",
        "allCategories": "ทุกหมวดหมู่",
        "filterColor": "กรองตามสี",
        "allColors": "ทุกสี",
        "filterSize": "กรองตามขนาด",
        "allSizes": "ทุกขนาด",
        "noProductsFound": "ไม่พบสินค้าที่ตรงกับเกณฑ์ของคุณ"
    },
    "story": {
        "title": "ถักทอด้วยความหลงใหล",
        "subtitle": "นี่ไม่ใช่แค่เนื้อผ้า แต่คือความรู้สึกเหมือนอยู่บ้าน คือการเชื่อมโยงกับธรรมชาติ คือเรื่องราวของความรัก",
        "introTitle": "เรื่องราวรักของผ้าสาลู",
        "introP1": "เรื่องราวของเราไม่ใช่แผนธุรกิจ แต่เป็นเรื่องราวของความรัก เรื่องราวที่เริ่มต้นจากความสุขที่เรียบง่ายและปฏิเสธไม่ได้ของการได้ห่อหุ้มด้วยสิ่งที่นุ่มนวลอย่างแท้จริง สิ่งที่หายใจไปพร้อมกับคุณ มันคือความรู้สึกของเช้าวันอาทิตย์ที่แสนเกียจคร้าน อ้อมกอดที่อบอุ่น ความสบายอันอ่อนโยนที่คุณคุ้นเคย นั่นคือผ้าสาลู นั่นคือ Saru",
        "section1Title": "การเดินทางผ่านสัมผัส",
        "section1p1": "เราตกหลุมรักผ้าสาลูไม่ใช่เพราะสิ่งที่มันเป็น แต่เพราะความรู้สึกที่มันมอบให้ วิธีที่การทอแบบเปิดช่วยให้อากาศสัมผัสผิว ทำให้มันเป็นเพื่อนคู่ใจในทุกฤดูกาล",
        "section1p2": "มันคือการเปลี่ยนแปลงที่น่าทึ่งเมื่อมันนุ่มขึ้นและเป็นส่วนตัวมากขึ้นทุกครั้งที่ซัก บอกเล่าเรื่องราวบนเส้นด้ายของมันเอง นี่ไม่ใช่แฟชั่นที่มาเร็วไปเร็ว แต่คือการใช้ชีวิตอย่างช้าๆ คือการเลือกเสื้อผ้าที่กลายเป็นส่วนหนึ่งของชีวิตคุณ เป็นเพื่อนที่ไว้ใจได้ที่มอบความสบายโดยไม่ต้องการสิ่งใดตอบแทน",
        "section2Title": "จากธรรมชาติ ด้วยความใส่ใจ",
        "section2p1": "ความหลงใหลของเราขยายไปถึงวิธีการสร้างสรรค์แต่ละชิ้นงาน เราเลือกที่จะทำงานกับช่างฝีมือที่เคารพในงานฝีมือเช่นเดียวกับเรา มือของพวกเขาสืบทอดความรู้มาหลายชั่วอายุคน",
        "section2p2": "เราใช้สีย้อมจากพืชธรรมชาติที่ให้โทนสีเอิร์ธโทนที่อ่อนโยนแก่เนื้อผ้าของเรา ทำให้มั่นใจได้ว่าสิ่งที่สัมผัสผิวของคุณนั้นบริสุทธิ์และใจดีเหมือนธรรมชาติ เส้นใยแต่ละเส้นเป็นเครื่องยืนยันถึงวิถีชีวิตที่ช้าลงและใส่ใจมากขึ้น",
        "section3Title": "มากกว่าเสื้อผ้า คือทางเลือก",
        "section3p1": "ในโลกที่เต็มไปด้วยความวุ่นวายและความเร็ว เรามองหาช่วงเวลาที่เงียบสงบ ความสุขที่เรียบง่าย การสวมใส่ Saru คือการเลือกความเรียบง่ายนั้น เป็นคำเชิญชวนให้ค้นหาความงามในความไม่สมบูรณ์แบบ และให้คุณค่ากับความสบายในฐานะรูปแบบหนึ่งของการดูแลตัวเอง",
        "section3p2": "มันคือความรู้สึกเชื่อมโยงกับร่างกายของคุณ กับโลกใบนี้ และกับมือที่สร้างสรรค์เสื้อผ้าของคุณ มันคือการต่อต้านอย่างเงียบๆ ต่อสิ่งที่ใช้แล้วทิ้ง และเป็นการเฉลิมฉลองสิ่งที่สร้างขึ้นมาเพื่อคงอยู่ เพื่อเป็นที่รัก และเพื่อใช้ชีวิตในนั้น",
        "outroTitle": "สวมใส่เรื่องราวของคุณ",
        "outroP1": "การเลือก Saru คือการเลือกสวมใส่เรื่องราวที่ถักทอด้วยความหลงใหล ความซื่อสัตย์ และความรักอันลึกซึ้งต่อความมหัศจรรย์อันเรียบง่ายของผ้าสาลู เราขอเชิญคุณร่วมเดินทางไปกับเรา ห่อหุ้มตัวเองด้วยความสบาย และทำให้เรื่องราวของเราเป็นส่วนหนึ่งของคุณ"
    },
    "whySaru": {
        "title": "ทำไมต้อง Saru?",
        "subtitle": "ความมหัศจรรย์อันเรียบง่ายของผ้าฝ้ายมัสลิน",
        "p1": "Saru เป็นมากกว่าแค่ชื่อ แต่เป็นคำของเราที่ใช้เรียกผ้าฝ้ายมัสลิน ซึ่งเป็นผ้าที่ได้รับการยกย่องมานานหลายศตวรรษในด้านคุณสมบัติที่เป็นเอกลักษณ์ เราเลือกผ้าฝ้ายมัสลินไม่ใช่แค่เพราะความสวยงาม แต่เพื่อประโยชน์อันน่าทึ่งที่มันนำมาสู่ชีวิตประจำวันของคุณ มันเป็นผ้าที่ดูแลคุณ เช่นเดียวกับที่เราใส่ใจในวิธีการผลิต"
    },
    "login": {
        "title": "ยินดีต้อนรับ",
        "subtitle": "เข้าสู่ระบบเพื่อเข้าถึงบัญชีและประวัติการสั่งซื้อของคุณ",
        "signInWithGoogle": "ลงชื่อเข้าใช้ด้วย Google"
    },
    "register": {
        "title": "สร้างบัญชี",
        "subtitle": "ป้อนข้อมูลของคุณเพื่อสร้างบัญชี",
        "name": "ชื่อ",
        "namePlaceholder": "ชื่อของคุณ",
        "email": "อีเมล",
        "password": "รหัสผ่าน",
        "createAccount": "สร้างบัญชี",
        "hasAccount": "มีบัญชีอยู่แล้ว?",
        "signIn": "เข้าสู่ระบบ"
    },
    "checkout": {
        "emptyCartTitle": "ตะกร้าสินค้าของคุณว่างเปล่า",
        "emptyCartSubtitle": "ดูเหมือนว่าคุณยังไม่ได้เพิ่มสินค้าใดๆ ลงในตะกร้า",
        "startShopping": "เริ่มช้อปปิ้ง",
        "title": "ชำระเงิน",
        "shippingInfo": "ข้อมูลการจัดส่ง",
        "fullName": "ชื่อ-นามสกุล",
        "address": "ที่อยู่",
        "city": "เมือง",
        "postalCode": "รหัสไปรษณีย์",
        "country": "ประเทศ",
        "paymentMethod": "วิธีการชำระเงิน",
        "paymentNotImplemented": "ยังไม่เปิดให้บริการชำระเงิน",
        "placeOrder": "สั่งซื้อสินค้า",
        "orderSummary": "สรุปรายการสั่งซื้อ",
        "quantity": "จำนวน",
        "subtotal": "ยอดรวม",
        "shipping": "ค่าจัดส่ง",
        "free": "ฟรี",
        "taxes": "ภาษี",
        "calculatedAtNextStep": "จะคำนวณในขั้นตอนถัดไป",
        "total": "ทั้งหมด"
    },
    "profile": {
        "title": "โปรไฟล์ของฉัน",
        "subtitle": "จัดการข้อมูลการจัดส่งและดูรายละเอียดของคุณ",
        "shippingInfo": "ข้อมูลการจัดส่ง",
        "fullName": "ชื่อ-นามสกุล",
        "address": "ที่อยู่",
        "city": "เมือง",
        "postalCode": "รหัสไปรษณีย์",
        "country": "ประเทศ",
        "saveChanges": "บันทึกการเปลี่ยนแปลง",
        "changesSaved": "บันทึกการเปลี่ยนแปลงของคุณแล้ว",
        "errorSaving": "ไม่สามารถบันทึกการเปลี่ยนแปลงได้"
    }
}

    